# Ejercicios Pandas DataFrames 01

1. Escribe un programa Pandas para conectarte a la base de datos datafundamentals y carga los pagos como un dataframe

In [3]:
import psycopg2

def create_pg_connection():
    conn = None
    try:
        conn = psycopg2.connect(database="datafundamentasl", user="datafundamentasl_owner", password="yPDtEpT5R6mI", host="ep-super-meadow-a2w5lasv.eu-central-1.aws.neon.tech", port=5432)
        print("Database conn successful")
    except Exception as err:
        print(f"Error: '{err}'")

    return conn

In [8]:
import pandas as pd

conn_pg = create_pg_connection()

df = pd.read_sql_query("SELECT * FROM payments", conn_pg) 

conn_pg.close()

df.info()

Database conn successful
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 259 entries, 0 to 258
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   customernumber  259 non-null    int64
 1   checknumber     259 non-null    object
 2   paymentdate     259 non-null    object
 3   amount          259 non-null    float64
dtypes: float64(1), int64(1), object(2)
memory usage: 8.2+ KB

In [9]:
df.head()

   customernumber checknumber paymentdate    amount
0             103    HQ336336  2004-10-19   6066.78
1             103    JM555205  2003-06-05  14571.44
2             103    OM314933  2004-12-18   1676.14
3             112    BO864823  2004-12-17  14191.12
4             112     HQ55022  2003-06-06  32641.98

In [10]:
df.tail()

     customernumber checknumber paymentdate    amount
254             495    BH167026  2003-12-26  59265.14
255             495    FN155234  2004-05-14   6276.60
256             496    EU531600  2005-05-25  30253.75
257             496    MB342426  2003-07-16  32077.44
258             496     MN89921  2004-12-31  52166.00

In [11]:
df.describe()

       customernumber         amount
count      259.000000     259.000000
mean       270.779923   32419.803707
std        120.336164   20633.076867
min        103.000000    1128.200000
25%        161.000000   17195.910000
50%        250.000000   32077.440000
75%        359.500000   44989.560000
max        496.000000  120166.580000

2. Escribe un programa Pandas para conectarte a la base de datos datafundamentals y guardar el df de pagos en una tabla nueva. Luego muestra las tablas en la bbdd y comprueba que existe la nueva tabla.

**Tip:** Usar sqlalchemy (https://www.sqlalchemy.org/)
```
# !pip install sqlalchemy

from sqlalchemy import create_engine
engine = create_engine('db_url')
df.sql('table_name',engine)
```

In [12]:
!pip install sqlalchemy

Collecting sqlalchemy
  Downloading SQLAlchemy-2.0.37-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (3.1 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 3.1/3.1 MB 17.9 MB/s eta 0:00:0000:0100:01
Requirement already satisfied: typing-extensions>=4.6.0 in /anaconda/envs/azureml_py38/lib/python3.10/site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in /anaconda/envs/azureml_py38/lib/python3.10/site-packages (from sqlalchemy) (3.1.1)
Installing collected packages: sqlalchemy
Successfully installed sqlalchemy-2.0.37

In [14]:
from sqlalchemy import create_engine

engine = create_engine('postgresql://datafundamentasl_owner:yPDtEpT5R6mI@ep-super-meadow-a2w5lasv.eu-central-1.aws.neon.tech/datafundamentasl?sslmode=require')

df[:10].to_sql('pagos2', engine, if_exists='replace', index=False)

AttributeError: 'Engine' object has no attribute 'cursor'

3. Escribe un programa Pandas para seleccionar filas donde el valor de la columna "amount" sea mayor que 4.

In [15]:
df[df['amount'] > 400]

     customernumber checknumber paymentdate    amount
0               103    HQ336336  2004-10-19   6066.78
1               103    JM555205  2003-06-05  14571.44
2               103    OM314933  2004-12-18   1676.14
3               112    BO864823  2004-12-17  14191.12
4               112     HQ55022  2003-06-06  32641.98
..              ...         ...         ...       ...
254             495    BH167026  2003-12-26  59265.14
255             495    FN155234  2004-05-14   6276.60
256             496    EU531600  2005-05-25  30253.75
257             496    MB342426  2003-07-16  32077.44
258             496     MN89921  2004-12-31  52166.00

[259 rows x 4 columns]

4. Escribe un programa Pandas para seleccionar solo las columnas "checknumber" y "paymentdate" del DataFrame.

In [17]:
df[["checknumber", "paymentdate"]]

    checknumber paymentdate
0      HQ336336  2004-10-19
1      JM555205  2003-06-05
2      OM314933  2004-12-18
3      BO864823  2004-12-17
4       HQ55022  2003-06-06
..          ...         ...
254    BH167026  2003-12-26
255    FN155234  2004-05-14
256    EU531600  2005-05-25
257    MB342426  2003-07-16
258     MN89921  2004-12-31

[259 rows x 2 columns]

5. Escribe un programa Pandas para definir un MultiIndex (multi-índice: varios índices para cada fila), basados en 2 columnas, para:
- acceder a datos específicos mediante él
- segmentar el DataFrame en función de los niveles de MultiIndex.

In [19]:
newdf = df.set_index(['customernumber', 'checknumber'])
newdf.head

<bound method NDFrame.head of                            paymentdate    amount
customernumber checknumber
103            HQ336336     2004-10-19   6066.78
               JM555205     2003-06-05  14571.44
               OM314933     2004-12-18   1676.14
112            BO864823     2004-12-17  14191.12
               HQ55022      2003-06-06  32641.98
...                                ...       ...
495            BH167026     2003-12-26  59265.14
               FN155234     2004-05-14   6276.60
496            EU531600     2005-05-25  30253.75
               MB342426     2003-07-16  32077.44
               MN89921      2004-12-31  52166.00

[259 rows x 2 columns]>

In [20]:
newdf.loc[(112,'BO864823')]

paymentdate    2004-12-17
amount           14191.12
Name: (112, BO864823), dtype: object

In [ ]:
newdf.loc[103]

5. Escribe un programa Pandas para seleccionar las primeras tres filas usando iloc.

In [ ]:
df.iloc[:3]

6. Escribe un programa Pandas para usar loc para seleccionar filas aplicando una condición dada en 2 columas.

In [ ]:
df.loc[(df['amount'] > 400) & (df['customernumber']>400)]

7. Escribe un programa Pandas que utilice loc para cambiar en el valor de amount de las filas que cumplan con una condición.

In [ ]:
df.loc[(df['amount'] > 400) & (df['customernumber'] > 490), ('amount','paymentdate')] = (0,'2025-01-01')
df.loc[(df['customernumber'] > 490)]

8. Escribe un programa Pandas que utilice .loc para dividir un DataFrame en función de las etiquetas de filas y columnas.

In [ ]:
df.loc[13:40,['customernumber','amount']]

9. Escribe un programa Pandas que utilice .loc para segmentar un DataFrame multi-índice.

In [ ]:
newdf.loc[112:145]